app/controllers/alcools_controller.rb

SELECT "alcools".* FROM "alcools" WHERE (alcools.quantity < alcools.quantity)
---
  def index
    @alcools = Alcool.all

INSERT INTO "alcools" ("created_at", "limit_alcool", "name", "quantity", "quantity_command", "updated_at") VALUES ('2010-08-16 08:30:58.395909', 20, 'vo', 45, NULL, '2010-08-16 08:30:58.395909')
---
  def create
    @alcool = Alcool.new(params[:alcool])
    if @alcool.save

SELECT "alcools".* FROM "alcools" WHERE ("alcools"."id" = 0) LIMIT 1
---
  def show
    @alcool = Alcool.find(params[:id])

SELECT "alcools".* FROM "alcools" WHERE ("alcools"."id" = 1) LIMIT 1
UPDATE "alcools" SET "quantity" = 51, "updated_at" = '2010-08-11 13:31:09.566683' WHERE ("alcools"."id" = 1)
---
  def update
    @alcool = Alcool.find(params[:id])

    if params[:increase]
      @alcool.quantity += params[:quantity].to_i
    else
      @alcool.quantity -= params[:quantity].to_i
    end
    @alcool.save

SELECT "alcools".* FROM "alcools" WHERE ("alcools"."id" = 1) LIMIT 1
UPDATE "alcools" SET "quantity_command" = 0 WHERE ("alcools"."id" = 1)
---
  def send_mail
    @alcool = Alcool.find(params[:id])
    @alcool.quantity_command = params[:quantity_command].to_i
    if @alcool.save

SELECT "alcools".* FROM "alcools" WHERE ("alcools"."id" = 1) LIMIT 1
---
  def command
    @alcool = Alcool.find(params[:id])